############################## 字符串不带换行 ##############################
a = 'a' \
    'b'
print(a) # ab

a = "a" \
    "b"
print(a) # ab

############################## 字符串带换行 ##############################
a = '''a
b'''
print(a)

a = """a
b
"""
print(a)

############################## 引号转义 ##############################
print("我说:\" 年轻人，想要做成大事，就要学会等待\" ")
# 我说:" 年轻人，想要做成大事，就要学会等待"

print('我说:"贵出如粪土，贱取如珠玉" ')
# 我说:"贵出如粪土，贱取如珠玉"


############################## 替换print结尾默认换行符 ##############################
print("我说", end="：")
print("无息币，勿完物")
# 我说：无息币，勿完物

############################## print 打印多个字符串中间会用空格隔开 ##############################
print("我说:","甲鱼要清炖", "膏蟹要红烧")
# 我说: 甲鱼要清炖 膏蟹要红烧

############################## 字符串拼接 ##############################
s = "农不出则乏其食"
print("我说:", s)
# 我说: 农不出则乏其食

s1 = '旱灾买船'
s2 = '涝灾买车'
print("我说: " + s1 + ", " + s2)
# 我说: 旱灾买船, 涝灾买车

s3 = '以牙还牙,加倍奉还'
print("我说: %s" %s3 )